{
  "games": [
    {
      "name": "Tales of Symphonia",
      "developer": "Namco Tales Studio",
      "releaseDate": "August 29, 2003",
      "description": "Tales of Symphonia is a classic Japanese role-playing game that follows Lloyd Irving and his companions on a journey to regenerate a dying world. Featuring real-time combat through the Linear Motion Battle System, the game blends action and strategy while emphasizing character relationships and moral choices. Its story explores themes of sacrifice, prejudice, and what it truly means to save the world.",
      "platforms": ["GameCube", "PlayStation 3", "PlayStation 4", "Nintendo Switch", "PC"]
    },
    {
      "name": "Pokémon Gold",
      "developer": "Game Freak",
      "releaseDate": "November 21, 1999",
      "description": "Pokémon Gold expanded the Pokémon universe with new creatures, mechanics, and the introduction of a real-time day and night system. Players explore the Johto region while collecting Pokémon, battling Gym Leaders, and thwarting Team Rocket’s plans. The game is celebrated for its sense of discovery, depth, and the surprise return to the Kanto region after completing the main story.",
      "platforms": ["Game Boy Color", "Nintendo 3DS (Virtual Console)"]
    },
    {
      "name": "Halo 3",
      "developer": "Bungie",
      "releaseDate": "September 25, 2007",
      "description": "Halo 3 concludes the original Halo trilogy, placing players once again in the role of the Master Chief as humanity fights for survival against the Covenant and the Flood. The game is known for its cinematic storytelling, refined gunplay, and expansive multiplayer modes. It became a cultural phenomenon thanks to its cooperative campaign, competitive online play, and robust Forge mode.",
      "platforms": ["Xbox 360", "Xbox One", "Xbox Series X|S", "PC"]
    },
    {
      "name": "The Legend of Zelda: Tears of the Kingdom",
      "developer": "Nintendo",
      "releaseDate": "May 12, 2023",
      "description": "The Legend of Zelda: Tears of the Kingdom builds upon the open-world foundation of Breath of the Wild, introducing new abilities that allow players to manipulate objects, craft vehicles, and explore the skies above Hyrule. The game emphasizes creativity and player-driven problem solving while delivering an epic story about the origins of Hyrule and an ancient threat. Its freedom of exploration and systemic design set a new benchmark for open-world games.",
      "platforms": ["Nintendo Switch"]
    },
    {
      "name": "Portal 2",
      "developer": "Valve",
      "releaseDate": "April 19, 2011",
      "description": "Portal 2 is a first-person puzzle game that challenges players to think spatially using a device that creates linked portals. Building on the original game, it introduces a longer campaign, new mechanics, and a memorable cast of characters, including the sarcastic AI GLaDOS. The game is widely praised for its clever level design, sharp humor, and engaging cooperative mode.",
      "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "Nintendo Switch"]
    },
    {
      "name": "Dishonored 2",
      "developer": "Arkane Studios",
      "releaseDate": "November 11, 2016",
      "description": "Dishonored 2 is a stealth-action game set in a richly detailed, steampunk-inspired world. Players can choose between two protagonists, each with unique supernatural abilities, and approach missions with freedom and creativity. The game emphasizes player choice, allowing for lethal or non-lethal solutions, and reacts dynamically to how the player shapes the world.",
      "platforms": ["PC", "PlayStation 4", "Xbox One"]
    },
    {
      "name": "Titanfall 2",
      "developer": "Respawn Entertainment",
      "releaseDate": "October 28, 2016",
      "description": "Titanfall 2 combines fast-paced first-person shooter combat with fluid parkour movement and massive mech battles. Its single-player campaign is praised for inventive level design and the emotional bond between the pilot and their Titan, BT-7274. The multiplayer expands on the original with deeper customization and refined mechanics, making it a standout in the genre.",
      "platforms": ["PC", "PlayStation 4", "Xbox One"]
    },
    {
      "name": "Baldur’s Gate 3",
      "developer": "Larian Studios",
      "releaseDate": "August 3, 2023",
      "description": "Baldur’s Gate 3 is a role-playing game set in the Dungeons & Dragons universe, offering deep narrative choices and turn-based tactical combat. Players create their own character or choose from origin heroes, shaping the story through dialogue, actions, and combat decisions. The game is known for its reactivity, freedom, and faithful adaptation of tabletop RPG systems.",
      "platforms": ["PC", "PlayStation 5", "Xbox Series X|S"]
    },
    {
      "name": "Persona 5",
      "developer": "Atlus",
      "releaseDate": "September 15, 2016",
      "description": "Persona 5 is a stylish Japanese role-playing game that follows a group of high school students who secretly explore supernatural palaces to change corrupt hearts. Blending turn-based combat with life simulation elements, the game balances dungeon crawling with daily activities and social relationships. Its bold art style, memorable soundtrack, and themes of rebellion and justice earned it widespread acclaim.",
      "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X|S", "Nintendo Switch", "PC"]
    },
    {
      "name": "Blue Prince",
      "developer": "Dogubomb",
      "releaseDate": "April 10, 2024",
      "description": "Blue Prince is a puzzle-adventure game centered around exploring a mysterious, ever-changing mansion. Each room presents unique challenges, secrets, and narrative fragments that slowly reveal the story behind the estate. The game emphasizes atmosphere, clever environmental puzzles, and player curiosity, rewarding careful observation and experimentation.",
      "platforms": ["PC", "PlayStation 5", "Xbox Series X|S"]
    },
    {
      "name": "No Man's Sky",
      "developer": "Hello Games",
      "releaseDate": "August 9, 2016",
      "description": "No Man's Sky is a science fiction exploration game set in a procedurally generated universe with billions of planets. Players can explore, trade, fight, and survive while uncovering the mysteries of the cosmos. Over time, extensive updates have expanded the game with base building, multiplayer, story content, and deep systems that transformed it into a rich and expansive space sandbox.",
      "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X|S", "Nintendo Switch"]
    },
    {
      "name": "Satisfactory",
      "developer": "Coffee Stain Studios",
      "releaseDate": "March 19, 2019",
      "description": "Satisfactory is a first-person factory-building and automation game set on an alien planet. Players gather resources, construct massive production lines, and optimize logistics to increase efficiency. The game blends exploration with complex engineering challenges, encouraging creativity and long-term planning as factories grow larger and more intricate.",
      "platforms": ["PC"]
    },
    {
      "name": "Animal Crossing: New Horizons",
      "developer": "Nintendo",
      "releaseDate": "March 20, 2020",
      "description": "Animal Crossing: New Horizons invites players to create a new life on a deserted island filled with charming animal neighbors. The game focuses on customization, relaxation, and real-time progression as players decorate their island, collect items, and build relationships. Its calming pace and creative freedom made it especially beloved as a social and comforting experience.",
      "platforms": ["Nintendo Switch"]
    },
    {
      "name": "God of War (2018)",
      "developer": "Santa Monica Studio",
      "releaseDate": "April 20, 2018",
      "description": "God of War (2018) reinvents the long-running series with a more grounded narrative and a new mythological setting inspired by Norse legends. Players follow Kratos and his son Atreus on an emotional journey that blends intense combat with character-driven storytelling. The game is praised for its cinematic presentation, refined combat system, and mature exploration of fatherhood.",
      "platforms": ["PlayStation 4", "PlayStation 5", "PC"]
    },
    {
      "name": "F-Zero GX",
      "developer": "Amusement Vision",
      "releaseDate": "July 25, 2003",
      "description": "F-Zero GX is a high-speed futuristic racing game known for its extreme difficulty and sense of speed. Players race anti-gravity vehicles on twisting tracks while managing boosts and sharp turns at breakneck velocities. The game stands out for its tight controls, bold visual style, and reputation as one of the most challenging racing games of its era.",
      "platforms": ["GameCube"]
    },
    {
      "name": "FTL: Faster Than Light",
      "developer": "Subset Games",
      "releaseDate": "September 14, 2012",
      "description": "FTL: Faster Than Light is a roguelike strategy game where players command a spaceship fleeing across a hostile galaxy. Each run is procedurally generated, forcing players to make tough decisions about crew management, ship upgrades, and combat tactics. The game is celebrated for its tension, replayability, and emergent storytelling.",
      "platforms": ["PC", "iOS"]
    },
    {
      "name": "The Binding of Isaac: Rebirth",
      "developer": "Nicalis",
      "releaseDate": "November 4, 2014",
      "description": "The Binding of Isaac: Rebirth is a dark roguelike dungeon crawler inspired by twin-stick shooters. Players control Isaac as he descends into procedurally generated dungeons filled with enemies, items, and disturbing imagery. Known for its challenging gameplay and massive item variety, the game offers near-endless replayability and discovery.",
      "platforms": ["PC", "PlayStation 4", "Xbox One", "Nintendo Switch", "PlayStation Vita"]
    },
    {
      "name": "Fable",
      "developer": "Lionhead Studios",
      "releaseDate": "September 14, 2004",
      "description": "Fable is an action role-playing game set in the fantasy world of Albion, where player choices directly shape the hero’s appearance and morality. The game emphasizes freedom, allowing players to decide how their character behaves and is perceived by others. Its blend of humor, storytelling, and consequence-driven gameplay made it a memorable RPG experience.",
      "platforms": ["Xbox", "PC", "Xbox 360"]
    },
    {
      "name": "Super Mario Galaxy",
      "developer": "Nintendo",
      "releaseDate": "November 1, 2007",
      "description": "Super Mario Galaxy reimagines classic Mario platforming by sending players across a universe of small, gravity-defying planets. The game introduces creative level designs that play with physics while maintaining tight, responsive controls. Its sense of wonder, inventive gameplay, and orchestral soundtrack helped define it as one of the greatest platformers ever made.",
      "platforms": ["Wii", "Nintendo Switch"]
    },
    {
      "name": "The Legend of Zelda: The Wind Waker",
      "developer": "Nintendo",
      "releaseDate": "March 24, 2003",
      "description": "The Legend of Zelda: The Wind Waker is a cel-shaded adventure game set in a vast oceanic world dotted with islands. Players control a young version of Link as he sails the seas, explores dungeons, and uncovers the fate of a flooded Hyrule. Initially divisive for its art style, the game is now widely praised for its expressive visuals, music, and sense of adventure.",
      "platforms": ["GameCube", "Wii U"]
    }
  ]
}
